lab4/lib/tasks/remove_hated_articles.rake

task remove_hated_articles: :environment do
  puts "remove hated articles #{Time.now}"
  count = Article.where(reports_count: 6...).delete_all
---
DELETE FROM "articles" WHERE "articles"."reports_count" >= 6