lab4/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    # @articles = Article.where(archived: [ false, nil ])
    @articles = Article.all

INSERT INTO "articles" ("title", "body", "reports_count", "created_at", "updated_at", "user_id", "archived") VALUES ('my rails journey', 'hello world', NULL, '2026-06-09 08:10:24.463630', '2026-06-09 08:10:24.463630', 1, NULL) RETURNING "id"
---
  def create
    @article = current_user.articles.build(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "updated_at" = '2026-06-09 08:16:12.176102' WHERE "articles"."id" = 1
---
  def update
    respond_to do |format|
      if @article.update(article_params)

UPDATE "articles" SET "reports_count" = COALESCE("articles"."reports_count", 0) + 1 WHERE "articles"."id" = 3
UPDATE "articles" SET "reports_count" = 11, "updated_at" = '2026-06-09 11:17:40.693345', "archived" = TRUE WHERE "articles"."id" = 3
---
  def report
    @article.update(reports_count: (@article.reports_count || 0) + 1)
    @article.save

DELETE FROM "articles" WHERE "articles"."id" = 5
---
  def destroy
    @article.destroy!

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 3 LIMIT 1
---
    def set_article_global
      @article = Article.find(params.expect(:id))

SELECT "articles".* FROM "articles" WHERE "articles"."id" = 6 LIMIT 1
---
    def set_article
      @article = current_user.articles.find(params.expect(:id))